cf/Catalogs/Currencies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Currencies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ExportingFromInternet</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionFull</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Markup</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MainCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WritingParametersInEnglish</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RateCalculationFormula</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SetRateMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CurrencyRateSetMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/Currencies/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

////////////////////////////////////////////////////////////////////////////////
// Objects bulk edit.

// Returns the list of attributes
// excluded from the scope of the batch object modification.
//
Function EditedAttributesInGroupDataProcessing() Export
	
	Result = New Array;
	Result.Add("SetRateMethod");
	Result.Add("Markup");
	Result.Add("MainCurrency");
	Result.Add("RateCalculationFormula");
	Return Result;
	
EndFunction

////////////////////////////////////////////////////////////////////////////////
// Data import from the file

// Prohibits to import data to this catalog
// from subsystem "DataLoadFromFile" because the catalog uses its data update method.
//
Function UseDataLoadFromFile() Export
	Return False;
EndFunction

// Rise { Sargsyan N 2016-08-17 
Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)
	
	StandardProcessing = False;
	
	Fields.Add("Description");
	Fields.Add("Ref");

EndProcedure

Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)  	

	StandardProcessing  = False;
	CurrentPresentation = PresentationsReUse.GetObjectPresentation(Data.Ref, PresentationsReUse.GetCurrentUserLanguageCode(),"Currencies");

	Если CurrentPresentation <> Undefined Тогда
		Presentation = CurrentPresentation;
	Иначе
		Presentation = Data.Description;
	КонецЕсли;
	
EndProcedure
// Rise } Sargsyan N 2016-08-17


#EndRegion

#EndIf
